nc: 80

# Backbone configuration with additional convolutional blocks
backbone:
  # New convolutional blocks
  - [-1, 1, SpinningConv, [3, 32, 3, 1]] #0
  - [-1, 1, SpinningConv, [32, 32, 3, 1]] #1
  - [-1, 1, SpinningConv, [32, 32, 3, 1]] #2
  - [-1, 3, C2f, [32, True]] #3

  - [-1, 1, Conv, [32, 64, 3, 2]]  #4  
  - [-1, 1, Conv, [64, 128, 3, 2]] #5
  - [-1, 3, C2f, [128, True]] #6
  
  - [-1, 1, Conv, [128, 256, 3, 2]] #7
  - [-1, 6, C2f, [256, True]] #8
  - [-1, 1, Conv, [256, 512, 3, 2]] #9
  - [-1, 6, C2f, [512, True]] #10
  - [-1, 1, Conv, [512, 1024, 3, 2]] #11
  - [-1, 3, C2f, [1024, True]] #12
  - [-1, 1, SPPF, [1024, 512, 5]] #13

neck:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #14
  - [[-1, 10], 1, Concat, [1]] #15
  - [-1, 3, C2f, [1024, False]] #16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #17
  - [[-1, 8], 1, Concat, [1]] #18
  - [-1, 3, C2f, [1280, False]] #19
  - [-1, 1, Conv, [1280,2560, 3, 2]] #20
  - [[-1, 16], 1, Concat, [1]] #21
  - [-1, 3, C2f, [3584, False]] #22
  - [-1, 1, Conv, [3584, 7168, 3, 2]] #23
  - [[-1, 13], 1, Concat, [1]] #24
  - [-1, 3, C2f, [7680, False]] #25

head:
  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)